In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

C:\Users\HP\AppData\Local\Temp\ipykernel_5788\2754702711.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,Solam Susent,False
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,Willy Santantines,True

In [4]:
print(f'number of rows: {df.shape[0]}')
      
print(f'{df.info()}')

number of rows: 8693
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   8693 non-null   object
 1   HomePlanet    8492 non-null   object
 2   CryoSleep     8476 non-null   object
 3   Cabin         8494 non-null   object
 4   Destination   8511 non-null   object
 5   Age           8514 non-null   float64
 6   VIP           8490 non-null   object
 7   RoomService   8512 non-null   float64
 8   FoodCourt     8510 non-null   float64
 9   ShoppingMall  8485 non-null   float64
 10  Spa           8510 non-null   float64
 11  VRDeck        8505 non-null   float64
 12  Name          8493 non-null   object
 13  Transported   8693 non-null   bool
dtypes: bool(1), float64(6), object(7)
memory usage: 891.5+ KB
None

In [10]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8514.000000,8512.000000,8510.000000,8485.000000,8510.000000,8505.000000
mean,28.827930,224.687617,458.077203,173.729169,311.138778,304.854791
std,14.489021,666.717663,1611.489240,604.696458,1136.705535,1145.717189
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,27.000000,59.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [8]:
#Investigating nan values

#Names
print(df[df.Name.isna()].shape[0])
df[df.Name.isna()].head()

200

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
27,0022_01,Mars,False,D/0/P,TRAPPIST-1e,21.0,False,980.0,2.0,69.0,0.0,0.0,NaN,False
58,0064_01,Mars,True,F/14/S,TRAPPIST-1e,15.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
65,0069_01,Earth,False,F/16/S,TRAPPIST-1e,42.0,False,887.0,0.0,9.0,6.0,0.0,NaN,True
77,0082_03,Mars,False,F/16/P,TRAPPIST-1e,8.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
101,0108_02,Earth,False,G/19/S,TRAPPIST-1e,31.0,False,562.0,0.0,326.0,0.0,0.0,NaN,False

In [9]:
df[df.Name.isna()].describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,197.000000,199.000000,195.000000,196.000000,194.000000,196.000000
mean,28.050761,248.809045,462.312821,252.377551,291.479381,425.056122
std,15.548721,696.613956,1500.709392,1700.386746,829.241236,1995.127660
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,18.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,26.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,37.000000,113.000000,32.000000,41.000000,58.000000,22.000000
max,70.000000,6498.000000,12045.000000,23492.000000,6841.000000,24133.000000

In [11]:
# Home planet
print(df[df.HomePlanet.isna()].shape[0])
df[df.HomePlanet.isna()].head()

201

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
59,0064_02,NaN,True,E/3/S,TRAPPIST-1e,33.0,False,0.0,0.0,NaN,0.0,0.0,Colatz Keen,True
113,0119_01,NaN,False,A/0/P,TRAPPIST-1e,39.0,False,0.0,2344.0,0.0,65.0,6898.0,Batan Coning,False
186,0210_01,NaN,True,D/6/P,55 Cancri e,24.0,False,0.0,0.0,NaN,0.0,0.0,Arraid Inicont,True
225,0242_01,NaN,False,F/46/S,TRAPPIST-1e,18.0,False,313.0,1.0,691.0,283.0,0.0,Almone Sté,False
234,0251_01,NaN,True,C/11/S,55 Cancri e,54.0,False,0.0,0.0,0.0,0.0,0.0,Diphah Amsive,True

In [12]:
print(df[df.CryoSleep.isna()].shape[0])
df[df.CryoSleep.isna()].head()

217

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
92,0099_02,Earth,NaN,G/12/P,TRAPPIST-1e,2.0,False,0.0,0.0,0.0,0.0,0.0,Thewis Connelson,True
98,0105_01,Earth,NaN,F/21/P,TRAPPIST-1e,27.0,False,0.0,0.0,570.0,2.0,131.0,Carry Cleachrand,False
104,0110_02,Europa,NaN,B/5/P,TRAPPIST-1e,40.0,False,0.0,331.0,0.0,0.0,1687.0,Aldeba Bootious,False
111,0115_01,Mars,NaN,F/24/P,TRAPPIST-1e,26.0,False,0.0,0.0,0.0,0.0,NaN,Rohs Pead,True
152,0173_01,Earth,NaN,E/11/S,TRAPPIST-1e,58.0,False,0.0,985.0,0.0,5.0,0.0,Hilip Grifford,True

In [14]:
print(df[df.Cabin.isna()].shape[0])
df[df.Cabin.isna()].head()

199

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
15,0012_01,Earth,False,NaN,TRAPPIST-1e,31.0,False,32.0,0.0,876.0,0.0,0.0,Justie Pooles,False
93,0101_01,Mars,True,NaN,TRAPPIST-1e,31.0,False,0.0,0.0,0.0,0.0,0.0,Book Trad,True
103,0110_01,Europa,False,NaN,TRAPPIST-1e,32.0,False,0.0,410.0,6.0,3929.0,764.0,Graviph Aloubtled,False
222,0239_01,Mars,False,NaN,TRAPPIST-1e,37.0,False,637.0,0.0,0.0,92.0,319.0,Diedow Resty,False
227,0244_01,Mars,True,NaN,TRAPPIST-1e,43.0,False,0.0,0.0,0.0,0.0,0.0,Froos Sad,True

In [13]:
print(df[df.VRDeck.isna()].shape[0])
df[df.VRDeck.isna()].head()

188

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
7,0006_02,Earth,True,G/0/S,TRAPPIST-1e,28.0,False,0.0,0.0,0.0,0.0,NaN,Candra Jacostaffey,True
111,0115_01,Mars,NaN,F/24/P,TRAPPIST-1e,26.0,False,0.0,0.0,0.0,0.0,NaN,Rohs Pead,True
115,0120_01,Mars,True,F/25/P,TRAPPIST-1e,24.0,False,0.0,0.0,0.0,0.0,NaN,Bees Sacre,True
251,0278_01,Earth,False,NaN,TRAPPIST-1e,35.0,False,0.0,0.0,0.0,888.0,NaN,Judya Beachez,False
288,0316_02,Europa,True,B/9/S,TRAPPIST-1e,20.0,False,0.0,0.0,0.0,0.0,NaN,Beneba Sorbitter,True

### Observations
- `VIP` and `CryoSleep` are boolean but has nan values
- Almost every category has `nan` values, there appears to be little overlap
- People in `VIP` who are nan can be safely replaced by `False`
- People with `CryoSleep` at nan should be dropped

In [15]:
# y label
df.Transported.mean()

0.5036236051995858

In [26]:
# VIP
print(f'People who are VIP: {df.query("VIP == True").Transported.mean()}\nPeople who are not VIP: {df.query("VIP != True").Transported.mean()}\nPeople who are nan: {df[df.VIP.isna()].Transported.mean()}')

df.VIP.value_counts(dropna = False)

People who are VIP: 0.38190954773869346
People who are not VIP: 0.5064751589357194
People who are nan: 0.5123152709359606

VIP
False    8291
NaN       203
True      199
Name: count, dtype: int64

In [25]:
# VIP
print(f'People who are in CryoSleep: {df.query("CryoSleep == True").Transported.mean()}\nPeople who are not in CryoSleep: {df.query("CryoSleep != True").Transported.mean()}\nPeople who are nan: {df[df.CryoSleep.isna()].Transported.mean()}')

df.CryoSleep.value_counts(dropna = False)

People who are in CryoSleep: 0.8175831412578202
People who are not in CryoSleep: 0.33504243281471
People who are nan: 0.48847926267281105

CryoSleep
False    5439
True     3037
NaN       217
Name: count, dtype: int64

In [27]:
def vip_nan(df):
    df_out = df.copy()
    df_out.VIP = df_out.VIP.fillna('False')
    return df_out
def cryo_nan(df):
    df_out = df.copy()
    df_out = df_out.dropna(subset=['CryoSleep'])
    return df_out

df_in_use = df.copy()
df_in_use = vip_nan(df_in_use)
df_in_use = cryo_nan(df_in_use)

In [29]:
# Other observations, numerical values

df_in_use.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8298.000000,8297.000000,8296.000000,8276.000000,8298.000000,8295.000000
mean,28.851530,224.850187,458.003857,174.429555,311.994577,305.100663
std,14.480515,665.057747,1615.843798,609.451108,1142.580354,1147.401256
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,28.000000,61.000000,47.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

### Questions

- Is `RoomService`, `FoodCourt`, `ShoppingMall`, `Spa` and `VRDeck` money values?
    - These are all how much the passengers was billed for these services
- Is there any structure in the setup for `PassengerID`, `Cabin` and `Destination`?
    - `Cabin`: Takes the form deck/num/side, where side can be either P for Port or S for Starboard.
    - `PassengerID`: A unique Id for each passenger. Each Id takes the form gggg_pp where gggg indicates a group the passenger is travelling with and pp is their number within the group. People in a group are often family members, but not always.

In [66]:
# Making new features 
def passenger_group(df):
    df_out = df.copy()
    df_out['PassengerGroup'] = df_out.PassengerId.str.split('_').str[0]
    df_out['PassengerInternalGroupNumber'] = df_out.PassengerId.str.split('_').str[1]
    return df_out

def cabin_split(df):
    df_out = df.copy()
    df_out['Deck'] = df_out.Cabin.str.split('/').str[0]
    df_out['Num'] = df_out.Cabin.str.split('/').str[1]
    df_out['Side'] = df_out.Cabin.str.split('/').str[2]
    return df_out

In [67]:
df_in_use = passenger_group(df_in_use)
df_in_use = cabin_split(df_in_use)
df_in_use.sample(5)

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,...,VRDeck,Name,Transported,PassngerGroup,PassngerInternalGroupNumber,Deck,Num,Side,PassengerGroup,PassengerInternalGroupNumber
2154,2306_05,Europa,True,C/82/P,55 Cancri e,48.0,False,0.0,0.0,0.0,...,0.0,Bram Colensid,True,2306,05,C,82,P,2306,05
4431,4710_01,Mars,False,F/958/P,TRAPPIST-1e,22.0,False,130.0,15.0,2454.0,...,0.0,Lift Cread,True,4710,01,F,958,P,4710,01
7505,8027_02,Earth,False,F/1535/S,55 Cancri e,27.0,False,31.0,225.0,331.0,...,14.0,Wally Logannon,False,8027,02,F,1535,S,8027,02
2569,2755_01,Europa,True,B/85/P,55 Cancri e,36.0,False,0.0,0.0,0.0,...,0.0,Beneba Glousspidy,True,2755,01,B,85,P,2755,01
7891,8423_01,Earth,False,F/1620/S,TRAPPIST-1e,22.0,False,0.0,0.0,6.0,...,733.0,Analdy Bartez,False,8423,01,F,1620,S,8423,01

### More questions

- Where are people going? Where do they come from?
    - Most people come from either Earth, and there is an equal split between people from Mars and Europa. People from europa has a larger successrate than the others
- How many groups are there? How big are the passenger groups?
    - There are over 6000 groups most only have one passenger, no group has more than 8 people
    - Does groups with more than one have a larger or smaller successrate?
- Is there a correlation between `PassengerGroup` and `Transported`?
    - Nothing very clear
- What about `Decks`, `Nums` and `Side` does that mean anything?
    - `Decks`: most people are from F and G, people from B and C are more likely to be transported than any other group
    - `Side`: Deck sides are evenly split, a slight majority is in S and they also have a 10% higher transport rate

In [86]:
def category_checkout(cat, df_in_use = df_in_use):
    return df_in_use.groupby(cat, dropna= False).agg({'PassengerId':'nunique', 'Transported':'mean'}).rename(columns = {'PassengerId': 'number_of_passengers', 'Transported': 'transport_rate'})

In [87]:
# Where are people going?
category_checkout('Destination')

               number_of_passengers  transport_rate
Destination
55 Cancri e                    1756        0.611048
PSO J318.5-22                   777        0.505792
TRAPPIST-1e                    5765        0.471292
NaN                             178        0.500000

In [88]:
#Where are people from?
# Where are people going?
# Where are people going?
category_checkout('HomePlanet')

            number_of_passengers  transport_rate
HomePlanet
Earth                       4488        0.424242
Europa                      2073        0.658948
Mars                        1716        0.524476
NaN                          199        0.512563

In [79]:
#How many groups are there and how big are the groups?
print(f'Number of passenger groups {df_in_use.PassengerGroup.nunique()}\n')
df_in_use.groupby('PassengerGroup').agg({'PassengerInternalGroupNumber':'nunique', 'Transported':'mean'}).describe().rename(columns = {'Transported': 'transport_rate'})

Number of passenger groups 6109

       PassengerInternalGroupNumber  transport_rate
count                   6109.000000     6109.000000
mean                       1.387461        0.478283
std                        0.923736        0.469490
min                        1.000000        0.000000
25%                        1.000000        0.000000
50%                        1.000000        0.500000
75%                        1.000000        1.000000
max                        8.000000        1.000000

In [84]:
category_checkout('Deck', df_in_use)

      number_of_passengers  transport_rate
Deck
A                      250        0.492000
B                      760        0.736842
C                      724        0.678177
D                      468        0.435897
E                      856        0.357477
F                     2726        0.439839
G                     2496        0.517628
T                        4        0.250000
NaN                    192        0.500000

In [85]:
category_checkout('Side', df_in_use)

      number_of_passengers  transport_rate
Side
P                     4093        0.453213
S                     4191        0.553806
NaN                    192        0.500000

In [90]:
# Where are people going?
category_checkout(['Num'])

      number_of_passengers  transport_rate
Num
0                       18        0.333333
1                       15        0.666667
10                      12        0.500000
100                     12        0.583333
1000                     6        0.500000
...                    ...             ...
996                      1        1.000000
997                      2        0.000000
998                      4        0.250000
999                      6        0.833333
NaN                    192        0.500000

[1809 rows x 2 columns]

In [91]:
category_checkout('PassengerInternalGroupNumber')

                              number_of_passengers  transport_rate
PassengerInternalGroupNumber
01                                            6068        0.475939
02                                            1370        0.561314
03                                             557        0.614004
04                                             225        0.595556
05                                             124        0.556452
06                                              74        0.554054
07                                              45        0.511111
08                                              13        0.461538

### More questions
- It might be interesting to get an idea of total amount billed, is there a relationsship between that and transport rate
- Where do most people spend money, does where they spend money matter in terms of transport rate?

In [92]:
df_in_use.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,...,VRDeck,Name,Transported,PassngerGroup,PassngerInternalGroupNumber,Deck,Num,Side,PassengerGroup,PassengerInternalGroupNumber
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,...,0.0,Maham Ofracculy,False,0001,01,B,0,P,0001,01
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,...,44.0,Juanna Vines,True,0002,01,F,0,S,0002,01
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,...,49.0,Altark Susent,False,0003,01,A,0,S,0003,01
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,...,193.0,Solam Susent,False,0003,02,A,0,S,0003,02
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,...,2.0,Willy Santantines,True,0004,01,F,1,S,0004,01

In [93]:
df_in_use.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8298.000000,8297.000000,8296.000000,8276.000000,8298.000000,8295.000000
mean,28.851530,224.850187,458.003857,174.429555,311.994577,305.100663
std,14.480515,665.057747,1615.843798,609.451108,1142.580354,1147.401256
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,28.000000,61.000000,47.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [94]:
def total_billed(df):
    df_out = df.copy()
    billing = ['RoomService', 'FoodCourt', 'ShoppingMall', 'Spa', 'VRDeck']
    for i in billing:
        df_out[i] = df[i].fillna(0)
    df_out['TotalBill'] = df_out.RoomService + df_out.FoodCourt + df_out.ShoppingMall + df_out.Spa + df_out.VRDeck
    return df_out

In [96]:
df_in_use = total_billed(df_in_use)

df_in_use.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,TotalBill
count,8298.000000,8476.000000,8476.000000,8476.000000,8476.000000,8476.000000,8476.000000
mean,28.851530,220.101699,448.277489,170.313709,305.442544,298.585418,1442.720859
std,14.480515,658.790747,1599.955616,602.798802,1131.402772,1135.939344,2814.112526
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000,717.000000
75%,38.000000,41.000000,60.000000,23.000000,54.000000,40.250000,1434.250000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000,35987.000000